{
  "note_to_int": {
    "A0": 0,
    "A1": 1,
    "A1.A2": 2,
    "A1.A2.A4": 3,
    "A1.A2.A4.A3": 4,
    "A1.A2.C5": 5,
    "A1.A2.F#4": 6,
    "A1.A2.F#5.F#4": 7,
    "A1.A3": 8,
    "A1.A4.E2": 9,
    "A1.A5.G5": 10,
    "A1.B-1": 11,
    "A1.B-3": 12,
    "A1.C#2": 13,
    "A1.C#2.E2": 14,
    "A1.C2.A2": 15,
    "A1.C5": 16,
    "A1.D4": 17,
    "A1.E-3": 18,
    "A1.E2": 19,
    "A1.E2.B4": 20,
    "A1.E2.B5": 21,
    "A1.E2.B5.B4": 22,
    "A1.E2.C#2": 23,
    "A1.E2.E4": 24,
    "A1.E2.G#4": 25,
    "A1.F#1.D1.D2": 26,
    "A1.F#2": 27,
    "A1.F#2.E2": 28,
    "A1.F2": 29,
    "A1.F5.C5": 30,
    "A1.F7": 31,
    "A2": 32,
    "A2.A0.A1.A3.F#3": 33,
    "A2.A1": 34,
    "A2.A1.A3.A4": 35,
    "A2.A1.A4": 36,
    "A2.A1.B-1": 37,
    "A2.A1.C5": 38,
    "A2.A1.D4": 39,
    "A2.A1.E3.C#4.A3": 40,
    "A2.A3": 41,
    "A2.A3.A1": 42,
    "A2.A3.A4": 43,
    "A2.A3.C#3.C#4": 44,
    "A2.A3.F6.F5": 45,
    "A2.A4": 46,
    "A2.A4.F4": 47,
    "A2.A4.F4.C5": 48,
    "A2.A4.G#2.A3": 49,
    "A2.A4.G4": 50,
    "A2.A5": 51,
    "A2.B-2": 52,
    "A2.B-4": 53,
    "A2.B2": 54,
    "A2.B2.E6.E5": 55,
    "A2.B5.D3": 56,
    "A2.C#2": 57,
    "A2.C#3": 58,
    "A2.C#3.C#2": 59,
    "A2.C#3.E3": 60,
    "A2.C#4": 61,
    "A2.C#5": 62,
    "A2.C3": 63,
    "A2.C4": 64,
    "A2.C4.G4": 65,
    "A2.C5": 66,
    "A2.C5.C4": 67,
    "A2.C6": 68,
    "A2.D2": 69,
    "A2.D3": 70,
    "A2.D3.F3": 71,
    "A2.D4": 72,
    "A2.D5": 73,
    "A2.E-2": 74,
    "A2.E-3": 75,
    "A2.E-4": 76,
    "A2.E-4.A1.A4": 77,
    "A2.E-5": 78,
    "A2.E2.A1": 79,
    "A2.E3": 80,
    "A2.E3.C4.G3": 81,
    "A2.E4": 82,
    "A2.E5": 83,
    "A2.E5.A4": 84,
    "A2.E5.E3": 85,
    "A2.E5.F#3": 86,
    "A2.F#2": 87,
    "A2.F#2.A1.B1.E-2": 88,
    "A2.F#3": 89,
    "A2.F#4": 90,
    "A2.F#4.C4": 91,
    "A2.F#5": 92,
    "A2.F#5.A4": 93,
    "A2.F1": 94,
    "A2.F2": 95,
    "A2.F3": 96,
    "A2.F3.D3": 97,
    "A2.F3.F6": 98,
    "A2.F4": 99,
    "A2.F5": 100,
    "A2.F5.F4.E-5.C5.E-3": 101,
    "A2.G#2": 102,
    "A2.G2": 103,
    "A2.G3": 104,
    "A2.G3.A5.A4": 105,
    "A2.G4": 106,
    "A2.G4.D4": 107,
    "A2.G5": 108,
    "A2.G5.A4": 109,
    "A3": 110,
    "A3.A1": 111,
    "A3.A1.A2": 112,
    "A3.A1.B3.B1.C4.C2": 113,
    "A3.A2": 114,
    "A3.A2.A1": 115,
    "A3.A2.A4": 116,
    "A3.A2.A4.A5": 117,
    "A3.A2.A5.A4": 118,
    "A3.A2.B-2": 119,
    "A3.A2.C#5": 120,
    "A3.A2.E3.C#3": 121,
    "A3.A3": 122,
    "A3.A4": 123,
    "A3.A4.A2": 124,
    "A3.A4.A2.A1": 125,
    "A3.A4.A5": 126,
    "A3.A4.C#4": 127,
    "A3.A4.F#4": 128,
    "A3.A4.F3": 129,
    "A3.A4.F4": 130,
    "A3.A4.F4.B-3": 131,
    "A3.A4.F4.D4": 132,
    "A3.A5": 133,
    "A3.A5.A4": 134,
    "A3.A5.A4.A2": 135,
    "A3.A5.C5": 136,
    "A3.A5.D5.F#5.C5": 137,
    "A3.A5.E3.A4.C4.E5": 138,
    "A3.B-1": 139,
    "A3.B-1.D2": 140,
    "A3.B-2.B-1.B-3": 141,
    "A3.B-2.C3": 142,
    "A3.B-3": 143,
    "A3.B-3.B-2.B-1": 144,
    "A3.B-4": 145,
    "A3.B-4.F4.G#3.D5": 146,
    "A3.B-5": 147,
    "A3.B2": 148,
    "A3.B2.B1.C#2": 149,
    "A3.B2.E-3.F#3": 150,
    "A3.B3": 151,
    "A3.B4": 152,
    "A3.B5": 153,
    "A3.C#3": 154,
    "A3.C#3.E3": 155,
    "A3.C#4": 156,
    "A3.C#4.E3": 157,
    "A3.C#4.E4.C#3": 158,
    "A3.C#4.F3": 159,
    "A3.C#4.G3": 160,
    "A3.C#5": 161,
    "A3.C#5.A4": 162,
    "A3.C#5.C#4": 163,
    "A3.C#5.E4": 164,
    "A3.C#6": 165,
    "A3.C#6.C#5": 166,
    "A3.C2": 167,
    "A3.C2.C3.E-3": 168,
    "A3.C3": 169,
    "A3.C3.C2": 170,
    "A3.C3.C2.E-3": 171,
    "A3.C3.D5.F4.F3": 172,
    "A3.C3.E-3": 173,
    "A3.C3.E-4": 174,
    "A3.C3.F#3": 175,
    "A3.C4": 176,
    "A3.C4.C5": 177,
    "A3.C4.D4": 178,
    "A3.C4.E4": 179,
    "A3.C4.F#3": 180,
    "A3.C5": 181,
    "A3.C5.A4.F4": 182,
    "A3.C5.B4": 183,
    "A3.C5.C4": 184,
    "A3.C5.D5.B-3": 185,
    "A3.C5.E3": 186,
    "A3.C5.E5": 187,
    "A3.C5.F3": 188,
    "A3.C6": 189,
    "A3.C6.B-5": 190,
    "A3.C6.C4": 191,
    "A3.D2": 192,
    "A3.D3": 193,
    "A3.D3.A3.D3": 194,
    "A3.D3.A4": 195,
    "A3.D3.A4.E4": 196,
    "A3.D3.C3.D4": 197,
    "A3.D3.D4": 198,
    "A3.D3.D4.C3": 199,
    "A3.D3.F#5": 200,
    "A3.D3.F3": 201,
    "A3.D3.F3.B2": 202,
    "A3.D4": 203,
    "A3.D4.A3": 204,
    "A3.D4.B3": 205,
    "A3.D4.C4": 206,
    "A3.D4.D3": 207,
    "A3.D4.F#3": 208,
    "A3.D4.F3": 209,
    "A3.D4.F4": 210,
    "A3.D4.F4.A4": 211,
    "A3.D5": 212,
    "A3.D5.A4.F3.C5": 213,
    "A3.D5.C3": 214,
    "A3.D6.F6.B-3": 215,
    "A3.E-3": 216,
    "A3.E-4": 217,
    "A3.E-4.C4": 218,
    "A3.E-4.C5": 219,
    "A3.E-4.F#3": 220,
    "A3.E-4.F#5": 221,
    "A3.E-5": 222,
    "A3.E2": 223,
    "A3.E3": 224,
    "A3.E3.C#3": 225,
    "A3.E3.C#4": 226,
    "A3.E3.C3": 227,
    "A3.E3.C4.A4.E5": 228,
    "A3.E3.E4": 229,
    "A3.E3.E4.B3": 230,
    "A3.E4": 231,
    "A3.E4.A4": 232,
    "A3.E4.A4.E5": 233,
    "A3.E4.A5.C5.B4": 234,
    "A3.E4.C5": 235,
    "A3.E4.E3": 236,
    "A3.E4.E5.A4": 237,
    "A3.E4.F3": 238,
    "A3.E5": 239,
    "A3.E5.C4.G3.C5.G4": 240,
    "A3.E5.E4.A4.C5": 241,
    "A3.E6": 242,
    "A3.F#2": 243,
    "A3.F#3": 244,
    "A3.F#3.C3": 245,
    "A3.F#3.C4": 246,
    "A3.F#3.D2": 247,
    "A3.F#3.D3": 248,
    "A3.F#3.E-3": 249,
    "A3.F#3.E-4": 250,
    "A3.F#3.E-5.E-4": 251,
    "A3.F#3.F#2.C#3": 252,
    "A3.F#4": 253,
    "A3.F#4.C#4": 254,
    "A3.F#4.C4": 255,
    "A3.F#4.D4.A4": 256,
    "A3.F#4.F#6.F#5": 257,
    "A3.F#5": 258,
    "A3.F#5.F#4": 259,
    "A3.F1": 260,
    "A3.F2": 261,
    "A3.F3": 262,
    "A3.F3.C3": 263,
    "A3.F3.D3": 264,
    "A3.F3.D4": 265,
    "A3.F3.F4": 266,
    "A3.F3.G#3": 267,
    "A3.F3.G3": 268,
    "A3.F4": 269,
    "A3.F4.C4": 270,
    "A3.F4.D4": 271,
    "A3.F4.E4.G3": 272,
    "A3.F4.G3.E4": 273,
    "A3.F5": 274,
    "A3.F5.F4": 275,
    "A3.G#3": 276,
    "A3.G#4.C6.D5": 277,
    "A3.G#4.G#3": 278,
    "A3.G#5.C#4": 279,
    "A3.G2.G3": 280,
    "A3.G3": 281,
    "A3.G3.B3": 282,
    "A3.G4": 283,
    "A3.G5": 284,
    "A3.G5.A5": 285,
    "A3.G5.B3": 286,
    "A3.G5.B4.B2.A4": 287,
    "A4": 288,
    "A4.A2": 289,
    "A4.A2.A3": 290,
    "A4.A2.B-4": 291,
    "A4.A3": 292,
    "A4.A3.A1.A2": 293,
    "A4.A3.A2": 294,
    "A4.A3.A2.A1": 295,
    "A4.A3.B-4": 296,
    "A4.A3.B2": 297,
    "A4.A3.C#4": 298,
    "A4.A3.C#4.E3": 299,
    "A4.A3.C#5": 300,
    "A4.A3.C4.E3": 301,
    "A4.A3.C4.F4": 302,
    "A4.A3.C5": 303,
    "A4.A3.D4": 304,
    "A4.A3.D4.D3": 305,
    "A4.A3.D5": 306,
    "A4.A3.E-3": 307,
    "A4.A3.E-4.F#4.C4.C3": 308,
    "A4.A3.F3": 309,
    "A4.A4": 310,
    "A4.A4.A5": 311,
    "A4.A5": 312,
    "A4.A5.A3": 313,
    "A4.A5.A6": 314,
    "A4.A5.B4.C5.G5": 315,
    "A4.A5.D5": 316,
    "A4.A5.F#5.E-5": 317,
    "A4.A5.F5": 318,
    "A4.A5.G#5": 319,
    "A4.A5.G4": 320,
    "A4.A5.G5": 321,
    "A4.A6": 322,
    "A4.B-3": 323,
    "A4.B-4": 324,
    "A4.B-4.B-3": 325,
    "A4.B-4.B-3.F3": 326,
    "A4.B-4.C#2.C#3": 327,
    "A4.B-4.C#3.B4.C#2": 328,
    "A4.B-4.F#4.G#4": 329,
    "A4.B-4.G#4": 330,
    "A4.B-4.G#4.F#4": 331,
    "A4.B1": 332,
    "A4.B2": 333,
    "A4.B2.F#3.E2.D4": 334,
    "A4.B2.G#4": 335,
    "A4.B3": 336,
    "A4.B3.G4": 337,
    "A4.B4": 338,
    "A4.B4.D4.G#4.F#4.C#4": 339,
    "A4.B4.E3": 340,
    "A4.C#2": 341,
    "A4.C#3": 342,
    "A4.C#3.B2.G#4": 343,
    "A4.C#3.G#4": 344,
    "A4.C#3.G#4.B2": 345,
    "A4.C#4": 346,
    "A4.C#5": 347,
    "A4.C#5.A5": 348,
    "A4.C#5.E5": 349,
    "A4.C#5.F4": 350,
    "A4.C2.C3": 351,
    "A4.C2.E4": 352,
    "A4.C3": 353,
    "A4.C3.A3": 354,
    "A4.C3.B2": 355,
    "A4.C4": 356,
    "A4.C4.A3": 357,
    "A4.C4.A3.A2.A1": 358,
    "A4.C4.B-3": 359,
    "A4.C4.C5": 360,
    "A4.C4.D3": 361,
    "A4.C4.D3.F#4": 362,
    "A4.C4.E-4": 363,
    "A4.C4.E-4.F#4": 364,
    "A4.C4.E-4.F#7.F#6": 365,
    "A4.C4.E4": 366,
    "A4.C4.F#4": 367,
    "A4.C4.F#4.E-4": 368,
    "A4.C5": 369,
    "A4.C5.E3": 370,
    "A4.D2": 371,
    "A4.D3": 372,
    "A4.D3.A3.D4.F#4": 373,
    "A4.D3.B-4": 374,
    "A4.D3.D4": 375,
    "A4.D4": 376,
    "A4.D4.A3": 377,
    "A4.D4.A3.A6.A5.D6": 378,
    "A4.D4.A4": 379,
    "A4.D4.B-4": 380,
    "A4.D4.B3": 381,
    "A4.D4.C5.F#2": 382,
    "A4.D4.D3": 383,
    "A4.D4.F#3.E2.B2": 384,
    "A4.D4.F#4": 385,
    "A4.D4.G4": 386,
    "A4.D5": 387,
    "A4.D5.A3": 388,
    "A4.D5.C5": 389,
    "A4.D5.D3": 390,
    "A4.D5.E5.B4": 391,
    "A4.D5.F#4.C5": 392,
    "A4.D5.F5": 393,
    "A4.D6": 394,
    "A4.E-2": 395,
    "A4.E-3": 396,
    "A4.E-3.C#5": 397,
    "A4.E-3.G4": 398,
    "A4.E-4": 399,
    "A4.E-4.A3": 400,
    "A4.E-4.B3": 401,
    "A4.E-4.F4": 402,
    "A4.E-5": 403,
    "A4.E-5.C4.E-4.F#4": 404,
    "A4.E-5.C5": 405,
    "A4.E-5.F4": 406,
    "A4.E2.C#5": 407,
    "A4.E3": 408,
    "A4.E3.A3": 409,
    "A4.E4": 410,
    "A4.E4.B-3.G3": 411,
    "A4.E4.B3": 412,
    "A4.E4.C#4": 413,
    "A4.E4.C4": 414,
    "A4.E4.D5": 415,
    "A4.E4.G4": 416,
    "A4.E5": 417,
    "A4.E5.C#5": 418,
    "A4.F#2": 419,
    "A4.F#2.A3": 420,
    "A4.F#2.D3": 421,
    "A4.F#3": 422,
    "A4.F#3.B2.D4.E2": 423,
    "A4.F#3.B2.E2": 424,
    "A4.F#3.B4": 425,
    "A4.F#3.C5": 426,
    "A4.F#3.G4": 427,
    "A4.F#4": 428,
    "A4.F#4.B-4.E-2.B3.E-4.E-1": 429,
    "A4.F#4.C4": 430,
    "A4.F#4.C4.E-4": 431,
    "A4.F#4.D4": 432,
    "A4.F#4.D4.C4": 433,
    "A4.F#4.E-4.C4.C4": 434,
    "A4.F#5": 435,
    "A4.F#5.E-5.G#5.C5": 436,
    "A4.F2": 437,
    "A4.F2.F4": 438,
    "A4.F3": 439,
    "A4.F3.F4.E-4.A3": 440,
    "A4.F4": 441,
    "A4.F4.A3": 442,
    "A4.F4.D2": 443,
    "A4.F4.D4": 444,
    "A4.F4.E-4.C4": 445,
    "A4.F4.E-5": 446,
    "A4.F4.E-5.C6": 447,
    "A4.F4.E3.A3": 448,
    "A4.F4.F#4": 449,
    "A4.F4.G4": 450,
    "A4.F5": 451,
    "A4.F5.D5": 452,
    "A4.F6": 453,
    "A4.G#3": 454,
    "A4.G#4": 455,
    "A4.G#5": 456,
    "A4.G1": 457,
    "A4.G3": 458,
    "A4.G4": 459,
    "A4.G4.B4": 460,
    "A4.G4.C4.G#4": 461,
    "A4.G4.E-4": 462,
    "A4.G4.E4": 463,
    "A4.G4.F#4": 464,
    "A4.G4.F2": 465,
    "A4.G5": 466,
    "A4.G5.A5": 467,
    "A4.G5.G#4.F#5": 468,
    "A5": 469,
    "A5.A2.E3": 470,
    "A5.A3": 471,
    "A5.A3.A2.A4": 472,
    "A5.A3.A4": 473,
    "A5.A3.B5": 474,
    "A5.A3.E-4": 475,
    "A5.A3.F3.A4": 476,
    "A5.A3.G5": 477,
    "A5.A4": 478,
    "A5.A4.A5": 479,
    "A5.A4.C#5": 480,
    "A5.A4.C4": 481,
    "A5.A4.C4.F5": 482,
    "A5.A4.C5": 483,
    "A5.A4.C6": 484,
    "A5.A4.D5": 485,
    "A5.A4.D5.F5": 486,
    "A5.A4.D5.F5.G5": 487,
    "A5.A4.E-5.F#5": 488,
    "A5.A4.E3": 489,
    "A5.A4.E5": 490,
    "A5.A4.F#5": 491,
    "A5.A4.F5": 492,
    "A5.A4.F5.C5": 493,
    "A5.A4.G#5": 494,
    "A5.A5.A4": 495,
    "A5.A6": 496,
    "A5.A6.C6.E6": 497,
    "A5.A6.C6.F6": 498,
    "A5.B-1": 499,
    "A5.B-2": 500,
    "A5.B-3": 501,
    "A5.B-4": 502,
    "A5.B-4.B-5.F4": 503,
    "A5.B-5": 504,
    "A5.B-5.B-1": 505,
    "A5.B-5.B-4": 506,
    "A5.B-5.G3.B-3": 507,
    "A5.B2.G5": 508,
    "A5.B3": 509,
    "A5.B3.G5": 510,
    "A5.B4.C5": 511,
    "A5.B4.D5": 512,
    "A5.B4.G5": 513,
    "A5.B5": 514,
    "A5.B5.E-6": 515,
    "A5.B5.G3": 516,
    "A5.B5.G5": 517,
    "A5.C#3": 518,
    "A5.C#3.B2": 519,
    "A5.C#4": 520,
    "A5.C#4.C#5.E5.A4.E4": 521,
    "A5.C#4.G5": 522,
    "A5.C#5": 523,
    "A5.C#5.E5.G#5": 524,
    "A5.C#5.G#5": 525,
    "A5.C#6": 526,
    "A5.C#6.A6": 527,
    "A5.C#6.E6": 528,
    "A5.C3": 529,
    "A5.C3.C5": 530,
    "A5.C3.C5.E3.G5": 531,
    "A5.C3.E5": 532,
    "A5.C4": 533,
    "A5.C4.E5": 534,
    "A5.C4.F3.F5": 535,
    "A5.C4.F5": 536,
    "A5.C4.G5": 537,
    "A5.C5": 538,
    "A5.C5.B-5.D5": 539,
    "A5.C5.B4": 540,
    "A5.C5.E-5": 541,
    "A5.C5.F#2": 542,
    "A5.C6": 543,
    "A5.C6.A6": 544,
    "A5.C6.G6.E-6.F6": 545,
    "A5.D2.B-5": 546,
    "A5.D3": 547,
    "A5.D3.F#5.G2": 548,
    "A5.D3.G5.E3": 549,
    "A5.D4": 550,
    "A5.D4.E4.G5": 551,
    "A5.D4.F3.D5.F5.A3": 552,
    "A5.D4.G5": 553,
    "A5.D5": 554,
    "A5.D5.F5": 555,
    "A5.D5.F5.A4": 556,
    "A5.D6": 557,
    "A5.D6.F#6": 558,
    "A5.E-2.B-5": 559,
    "A5.E-3": 560,
    "A5.E-5": 561,
    "A5.E-5.B4.A4": 562,
    "A5.E-5.C4.F3": 563,
    "A5.E-5.E-4": 564,
    "A5.E-6": 565,
    "A5.E-6.C6": 566,
    "A5.E3": 567,
    "A5.E3.F#5": 568,
    "A5.E4": 569,
    "A5.E4.G5": 570,
    "A5.E5": 571,
    "A5.E5.A4": 572,
    "A5.E5.C5": 573,
    "A5.E5.G#5": 574,
    "A5.E5.G5": 575,
    "A5.E6": 576,
    "A5.E6.C#6": 577,
    "A5.E6.E4.E5.C#6.E3": 578,
    "A5.E6.E5.C#6": 579,
    "A5.F#2": 580,
    "A5.F#2.D5": 581,
    "A5.F#3": 582,
    "A5.F#4": 583,
    "A5.F#4.D5": 584,
    "A5.F#5": 585,
    "A5.F#5.A4": 586,
    "A5.F#5.D5": 587,
    "A5.F#5.E-5": 588,
    "A5.F#6": 589,
    "A5.F#6.E-6.G#6.C6": 590,
    "A5.F2": 591,
    "A5.F3": 592,
    "A5.F3.F2.E-6": 593,
    "A5.F3.F5": 594,
    "A5.F3.G5": 595,
    "A5.F4": 596,
    "A5.F4.G5": 597,
    "A5.F5": 598,
    "A5.F5.A4": 599,
    "A5.F5.C6": 600,
    "A5.F5.D5": 601,
    "A5.F5.D5.A4": 602,
    "A5.F5.D5.A4.F4.D4": 603,
    "A5.F5.F3": 604,
    "A5.F5.F4": 605,
    "A5.F5.G5": 606,
    "A5.G#5": 607,
    "A5.G#5.E5": 608,
    "A5.G2": 609,
    "A5.G2.B-5": 610,
    "A5.G3": 611,
    "A5.G3.B5": 612,
    "A5.G3.G5": 613,
    "A5.G4": 614,
    "A5.G4.E3.C#5": 615,
    "A5.G4.G5": 616,
    "A5.G5": 617,
    "A5.G5.B-2": 618,
    "A5.G5.F#5": 619,
    "A5.G5.F5": 620,
    "A6": 621,
    "A6.A3.E6.E7.A2.C#7": 622,
    "A6.A4": 623,
    "A6.A4.C6": 624,
    "A6.A5": 625,
    "A6.A5.C6.E-6.F6": 626,
    "A6.A5.F6.C6": 627,
    "A6.A5.G#5": 628,
    "A6.A5.G#6": 629,
    "A6.B-6": 630,
    "A6.B2.B1.F#6": 631,
    "A6.B6": 632,
    "A6.C#4": 633,
    "A6.C#6": 634,
    "A6.C#6.A3.E6": 635,
    "A6.C#6.F#6.A5": 636,
    "A6.C#7": 637,
    "A6.C3.A5.C2.E-6.F#2": 638,
    "A6.C6": 639,
    "A6.C7": 640,
    "A6.D6": 641,
    "A6.E-6": 642,
    "A6.E-7": 643,
    "A6.E-7.C7": 644,
    "A6.E3.C#4.A5": 645,
    "A6.E6": 646,
    "A6.E6.E7": 647,
    "A6.E7": 648,
    "A6.F#4": 649,
    "A6.F#6": 650,
    "A6.F6": 651,
    "A6.G#6": 652,
    "A6.G6": 653,
    "A7": 654,
    "B-0": 655,
    "B-0.A0.B-1": 656,
    "B-0.B-1": 657,
    "B-0.B-1.B-1": 658,
    "B-0.C1": 659,
    "B-1": 660,
    "B-1.A1": 661,
    "B-1.A3": 662,
    "B-1.B-0": 663,
    "B-1.B-2": 664,
    "B-1.B-2.B-3": 665,
    "B-1.B-2.B-3.B-4": 666,
    "B-1.B-2.B-4.B-3": 667,
    "B-1.B-2.C2.C3": 668,
    "B-1.B-2.E4": 669,
    "B-1.B-2.F4.D4": 670,
    "B-1.B-3": 671,
    "B-1.B-4": 672,
    "B-1.B-4.B-2.B-3": 673,
    "B-1.B-4.B-5": 674,
    "B-1.B1": 675,
    "B-1.B1.C2": 676,
    "B-1.B4.B3": 677,
    "B-1.C#2": 678,
    "B-1.C#4": 679,
    "B-1.C2": 680,
    "B-1.C2.F#2": 681,
    "B-1.C4": 682,
    "B-1.D2": 683,
    "B-1.D3": 684,
    "B-1.D3.C2": 685,
    "B-1.D4": 686,
    "B-1.E-2": 687,
    "B-1.E-3": 688,
    "B-1.E-4": 689,
    "B-1.E-5.E-6": 690,
    "B-1.E7.B-2.E6": 691,
    "B-1.F#2": 692,
    "B-1.F1": 693,
    "B-1.F2": 694,
    "B-1.F2.B-3.D3.F3.D4": 695,
    "B-1.F3": 696,
    "B-1.F3.D3": 697,
    "B-1.G#1": 698,
    "B-1.G#3": 699,
    "B-1.G#4": 700,
    "B-1.G#5": 701,
    "B-1.G2": 702,
    "B-1.G3": 703,
    "B-1.G4": 704,
    "B-1.G4.B-2": 705,
    "B-1.G5": 706,
    "B-2": 707,
    "B-2.A1.B-1": 708,
    "B-2.A2": 709,
    "B-2.A2.B-2": 710,
    "B-2.A4": 711,
    "B-2.A5": 712,
    "B-2.B-0.B-1.E3.D3.F#3": 713,
    "B-2.B-1": 714,
    "B-2.B-1.B-3": 715,
    "B-2.B-1.B-3.B-4": 716,
    "B-2.B-1.B-4.B-3": 717,
    "B-2.B-1.B2": 718,
    "B-2.B-1.C#3": 719,
    "B-2.B-3": 720,
    "B-2.B-3.B-1.B-0": 721,
    "B-2.B-3.B-4.B-5": 722,
    "B-2.B-3.D5.D4": 723,
    "B-2.B-4": 724,
    "B-2.B-4.B-3": 725,
    "B-2.B-4.B2": 726,
    "B-2.B-4.D4": 727,
    "B-2.B-5": 728,
    "B-2.B-5.B-3.B-4": 729,
    "B-2.B-5.D5": 730,
    "B-2.B-5.F3": 731,
    "B-2.B2": 732,
    "B-2.B2.E2": 733,
    "B-2.B3": 734,
    "B-2.C#3": 735,
    "B-2.C#3.F3": 736,
    "B-2.C#4": 737,
    "B-2.C#4.B-4": 738,
    "B-2.C#5": 739,
    "B-2.C#5.B-3": 740,
    "B-2.C2": 741,
    "B-2.C3": 742,
    "B-2.C4": 743,
    "B-2.C5": 744,
    "B-2.C6": 745,
    "B-2.C6.C5": 746,
    "B-2.C6.G5": 747,
    "B-2.D2": 748,
    "B-2.D3": 749,
    "B-2.D3.F2": 750,
    "B-2.D4": 751,
    "B-2.D4.B-2": 752,
    "B-2.D4.B-3": 753,
    "B-2.D4.G3.G4": 754,
    "B-2.D5": 755,
    "B-2.D5.B-4": 756,
    "B-2.D6": 757,
    "B-2.E-2": 758,
    "B-2.E-3": 759,
    "B-2.E-3.E-2": 760,
    "B-2.E-3.E-2.G5": 761,
    "B-2.E-3.G2": 762,
    "B-2.E-3.G3": 763,
    "B-2.E-4": 764,
    "B-2.E-5": 765,
    "B-2.E-5.F5": 766,
    "B-2.E2": 767,
    "B-2.E3": 768,
    "B-2.E4": 769,
    "B-2.E4.E5": 770,
    "B-2.E6.G5.C6.C3": 771,
    "B-2.F#1": 772,
    "B-2.F#3": 773,
    "B-2.F#4": 774,
    "B-2.F#5": 775,
    "B-2.F1": 776,
    "B-2.F2": 777,
    "B-2.F3": 778,
    "B-2.F3.B-3": 779,
    "B-2.F3.B-3.B-4.D5.B-5.D4.F5.C4": 780,
    "B-2.F3.D3": 781,
    "B-2.F3.D4.D3.B-3": 782,
    "B-2.F4": 783,
    "B-2.F4.B-3.D4.F2": 784,
    "B-2.F4.F5": 785,
    "B-2.F5": 786,
    "B-2.F5.G#4": 787,
    "B-2.F6": 788,
    "B-2.G#2": 789,
    "B-2.G#3": 790,
    "B-2.G#4.B-4": 791,
    "B-2.G#4.G#5": 792,
    "B-2.G#5": 793,
    "B-2.G#5.C5": 794,
    "B-2.G#6": 795,
    "B-2.G1": 796,
    "B-2.G2": 797,
    "B-2.G3": 798,
    "B-2.G3.D3": 799,
    "B-2.G4": 800,
    "B-2.G4.B-3": 801,
    "B-2.G4.D4": 802,
    "B-2.G5": 803,
    "B-2.G5.G4.D5": 804,
    "B-2.G6": 805,
    "B-3": 806,
    "B-3.A2.C#3.E3": 807,
    "B-3.A3": 808,
    "B-3.A3.C#4.E-3": 809,
    "B-3.A3.E-3": 810,
    "B-3.A4": 811,
    "B-3.A4.F4.A3": 812,
    "B-3.A5": 813,
    "B-3.B-1": 814,
    "B-3.B-1.B-2": 815,
    "B-3.B-1.G#3": 816,
    "B-3.B-1.G1": 817,
    "B-3.B-2": 818,
    "B-3.B-2.B-1": 819,
    "B-3.B-2.B-4.B-5": 820,
    "B-3.B-2.B-5": 821,
    "B-3.B-2.B-5.B-4": 822,
    "B-3.B-2.C#4.C#5": 823,
    "B-3.B-2.E-2": 824,
    "B-3.B-2.F3": 825,
    "B-3.B-2.G3": 826,
    "B-3.B-4": 827,
    "B-3.B-4.A3": 828,
    "B-3.B-4.B-2": 829,
    "B-3.B-4.B-5": 830,
    "B-3.B-4.B-5.B-2": 831,
    "B-3.B-4.C#4.F#4": 832,
    "B-3.B-4.D4": 833,
    "B-3.B-4.E-2": 834,
    "B-3.B-4.G#4": 835,
    "B-3.B-4.G5": 836,
    "B-3.B-5": 837,
    "B-3.B-5.B-4": 838,
    "B-3.B1.F#3": 839,
    "B-3.B2": 840,
    "B-3.B3": 841,
    "B-3.C#3": 842,
    "B-3.C#3.C#4.F#3": 843,
    "B-3.C#3.E3": 844,
    "B-3.C#4": 845,
    "B-3.C#4.A4": 846,
    "B-3.C#4.B-4": 847,
    "B-3.C#4.B-5.B-4": 848,
    "B-3.C#4.C#5": 849,
    "B-3.C#4.C6.C5": 850,
    "B-3.C#4.E-3": 851,
    "B-3.C#4.E4": 852,
    "B-3.C#4.F3": 853,
    "B-3.C#4.F4": 854,
    "B-3.C#4.G3": 855,
    "B-3.C#5": 856,
    "B-3.C#5.B-4": 857,
    "B-3.C#5.E4": 858,
    "B-3.C#5.F3.C#3.F4.C#4": 859,
    "B-3.C#6": 860,
    "B-3.C2": 861,
    "B-3.C3": 862,
    "B-3.C3.C5.E3": 863,
    "B-3.C4": 864,
    "B-3.C4.C5": 865,
    "B-3.C4.E3": 866,
    "B-3.C5": 867,
    "B-3.C5.B-4": 868,
    "B-3.C5.C#5": 869,
    "B-3.C5.C4.G#3": 870,
    "B-3.C5.F4": 871,
    "B-3.C6": 872,
    "B-3.D2": 873,
    "B-3.D3": 874,
    "B-3.D3.B-2": 875,
    "B-3.D3.D4.B-4.D5": 876,
    "B-3.D3.D5": 877,
    "B-3.D3.F3": 878,
    "B-3.D3.G#3": 879,
    "B-3.D3.G3": 880,
    "B-3.D4": 881,
    "B-3.D4.A4": 882,
    "B-3.D4.B-4": 883,
    "B-3.D4.B-4.B-2": 884,
    "B-3.D4.B-4.F4": 885,
    "B-3.D4.B-4.G4": 886,
    "B-3.D4.D2": 887,
    "B-3.D4.F3": 888,
    "B-3.D4.G#3": 889,
    "B-3.D4.G#4": 890,
    "B-3.D4.G4.G2": 891,
    "B-3.D5": 892,
    "B-3.D5.G4.E3": 893,
    "B-3.D6": 894,
    "B-3.D6.B-5.D4": 895,
    "B-3.D7.D6.C#7": 896,
    "B-3.E-1.C#3.G3.E-2": 897,
    "B-3.E-2.B-2": 898,
    "B-3.E-3": 899,
    "B-3.E-3.B-4": 900,
    "B-3.E-3.C#3": 901,
    "B-3.E-3.F#3": 902,
    "B-3.E-3.G#1": 903,
    "B-3.E-3.G#2": 904,
    "B-3.E-3.G#3": 905,
    "B-3.E-4": 906,
    "B-3.E-4.B-2": 907,
    "B-3.E-4.B-4.G4": 908,
    "B-3.E-4.E-2": 909,
    "B-3.E-4.G3.E-3": 910,
    "B-3.E-4.G4": 911,
    "B-3.E-5": 912,
    "B-3.E-5.E-4": 913,
    "B-3.E-5.E-4.G3": 914,
    "B-3.E-5.E-4.G3.B-4": 915,
    "B-3.E-5.G4": 916,
    "B-3.E-5.G5": 917,
    "B-3.E3": 918,
    "B-3.E3.A2.C#3": 919,
    "B-3.E3.C#3": 920,
    "B-3.E3.F#3": 921,
    "B-3.E3.G3": 922,
    "B-3.E4": 923,
    "B-3.E4.B-4.E5.C#4.F#4": 924,
    "B-3.E4.C#4": 925,
    "B-3.E4.C4": 926,
    "B-3.E4.G3": 927,
    "B-3.E5": 928,
    "B-3.E5.G5": 929,
    "B-3.F#2": 930,
    "B-3.F#2.F#1": 931,
    "B-3.F#3": 932,
    "B-3.F#3.C#4": 933,
    "B-3.F#3.E-4": 934,
    "B-3.F#3.F#4": 935,
    "B-3.F#4": 936,
    "B-3.F#4.C#4": 937,
    "B-3.F#4.E-4": 938,
    "B-3.F#4.E4": 939,
    "B-3.F#5": 940,
    "B-3.F#5.F#4.C#4": 941,
    "B-3.F1": 942,
    "B-3.F2": 943,
    "B-3.F3": 944,
    "B-3.F3.A2.D3": 945,
    "B-3.F3.B-2": 946,
    "B-3.F3.B-2.F2": 947,
    "B-3.F3.C#4": 948,
    "B-3.F3.D4": 949,
    "B-3.F3.F4": 950,
    "B-3.F4": 951,
    "B-3.F4.B-4": 952,
    "B-3.F4.C#4": 953,
    "B-3.F4.D3.G2": 954,
    "B-3.F4.D4": 955,
    "B-3.F4.G#3": 956,
    "B-3.F4.G#4": 957,
    "B-3.F5": 958,
    "B-3.F5.C#5": 959,
    "B-3.F5.F4.B-4.F3": 960,
    "B-3.F5.G#4": 961,
    "B-3.G#2": 962,
    "B-3.G#2.E3": 963,
    "B-3.G#3": 964,
    "B-3.G#3.G#4": 965,
    "B-3.G#4": 966,
    "B-3.G#4.G#3": 967,
    "B-3.G#5": 968,
    "B-3.G1": 969,
    "B-3.G2": 970,
    "B-3.G2.D4": 971,
    "B-3.G2.D4.G1": 972,
    "B-3.G2.G1": 973,
    "B-3.G2.G3": 974,
    "B-3.G3": 975,
    "B-3.G3.D3": 976,
    "B-3.G3.E-3": 977,
    "B-3.G3.E-4": 978,
    "B-3.G3.E-4.B-4": 979,
    "B-3.G3.E-4.E-5": 980,
    "B-3.G3.E-6": 981,
    "B-3.G3.E3": 982,
    "B-3.G3.E4": 983,
    "B-3.G3.G2.B-4": 984,
    "B-3.G4": 985,
    "B-3.G4.E-4": 986,
    "B-3.G4.F4": 987,
    "B-3.G4.G3": 988,
    "B-3.G4.G3.D5": 989,
    "B-3.G5": 990,
    "B-3.G5.F#5": 991,
    "B-3.G5.F5": 992,
    "B-3.G5.G4": 993,
    "B-4": 994,
    "B-4.A3": 995,
    "B-4.A4": 996,
    "B-4.A4.E-4": 997,
    "B-4.A5": 998,
    "B-4.A5.A4": 999,
    "B-4.B-1": 1000,
    "B-4.B-1.A4": 1001,
    "B-4.B-1.B-2.D5": 1002,
    "B-4.B-2": 1003,
    "B-4.B-2.B-1": 1004,
    "B-4.B-2.B-3": 1005,
    "B-4.B-2.B-5": 1006,
    "B-4.B-2.C5": 1007,
    "B-4.B-2.G2": 1008,
    "B-4.B-3": 1009,
    "B-4.B-3.B-2": 1010,
    "B-4.B-3.B-2.B-1": 1011,
    "B-4.B-3.B-5": 1012,
    "B-4.B-3.B-6.B-5": 1013,
    "B-4.B-3.C#5": 1014,
    "B-4.B-3.C5": 1015,
    "B-4.B-3.D3": 1016,
    "B-4.B-3.D4": 1017,
    "B-4.B-3.E-4.F#4": 1018,
    "B-4.B-3.F#2.E4": 1019,
    "B-4.B-3.F#3": 1020,
    "B-4.B-3.F#4": 1021,
    "B-4.B-3.F3": 1022,
    "B-4.B-3.F3.D4": 1023,
    "B-4.B-3.F4.D4": 1024,
    "B-4.B-3.G#4": 1025,
    "B-4.B-3.G2": 1026,
    "B-4.B-3.G3": 1027,
    "B-4.B-3.G3.D4": 1028,
    "B-4.B-4": 1029,
    "B-4.B-5": 1030,
    "B-4.B-5.B-5": 1031,
    "B-4.B-5.B-6": 1032,
    "B-4.B-5.D5": 1033,
    "B-4.B-5.D5.G5": 1034,
    "B-4.B-5.E-5.F#5": 1035,
    "B-4.B-5.E-5.G#5": 1036,
    "B-4.B-5.F4.B-3.C#4.G3": 1037,
    "B-4.B-5.G5": 1038,
    "B-4.B-6": 1039,
    "B-4.B2": 1040,
    "B-4.B3": 1041,
    "B-4.B4": 1042,
    "B-4.C#2": 1043,
    "B-4.C#2.C#3.G4": 1044,
    "B-4.C#3": 1045,
    "B-4.C#4": 1046,
    "B-4.C#4.C5": 1047,
    "B-4.C#4.E2": 1048,
    "B-4.C#4.F#3.E4": 1049,
    "B-4.C#4.F4": 1050,
    "B-4.C#4.F4.G4": 1051,
    "B-4.C#4.G3.E-3": 1052,
    "B-4.C#4.G4": 1053,
    "B-4.C#5": 1054,
    "B-4.C#5.C#4": 1055,
    "B-4.C#5.D5": 1056,
    "B-4.C#5.E-4": 1057,
    "B-4.C#5.E4": 1058,
    "B-4.C#5.E5": 1059,
    "B-4.C#5.E5.G4.C#6.F5.B-5": 1060,
    "B-4.C#5.F#5": 1061,
    "B-4.C#5.F5": 1062,
    "B-4.C#5.G4.B-3.G3.D3": 1063,
    "B-4.C#5.G5.G4": 1064,
    "B-4.C#6": 1065,
    "B-4.C2": 1066,
    "B-4.C3": 1067,
    "B-4.C4": 1068,
    "B-4.C4.C5": 1069,
    "B-4.C4.G#3.G#4": 1070,
    "B-4.C4.G#4": 1071,
    "B-4.C5": 1072,
    "B-4.C5.B-3": 1073,
    "B-4.C5.B-4": 1074,
    "B-4.C5.D5.E5": 1075,
    "B-4.C6": 1076,
    "B-4.C6.F4": 1077,
    "B-4.C6.G#4": 1078,
    "B-4.D2": 1079,
    "B-4.D3": 1080,
    "B-4.D3.B-3": 1081,
    "B-4.D3.D5": 1082,
    "B-4.D4": 1083,
    "B-4.D4.B-3": 1084,
    "B-4.D4.B-3.F3": 1085,
    "B-4.D4.C5": 1086,
    "B-4.D4.D3": 1087,
    "B-4.D4.F#4": 1088,
    "B-4.D4.F4": 1089,
    "B-4.D4.F4.B-3": 1090,
    "B-4.D4.G3.E3.E-4": 1091,
    "B-4.D5": 1092,
    "B-4.D5.B-3": 1093,
    "B-4.D5.B-5": 1094,
    "B-4.D5.D6.B-5": 1095,
    "B-4.D5.E-5.B4": 1096,
    "B-4.D5.F3": 1097,
    "B-4.D5.F5": 1098,
    "B-4.D5.G3": 1099,
    "B-4.D6": 1100,
    "B-4.D6.F4": 1101,
    "B-4.E-1.E-2.E-5": 1102,
    "B-4.E-2": 1103,
    "B-4.E-2.E-3": 1104,
    "B-4.E-3": 1105,
    "B-4.E-3.C#3": 1106,
    "B-4.E-3.C#5": 1107,
    "B-4.E-3.D5": 1108,
    "B-4.E-3.G4": 1109,
    "B-4.E-4": 1110,
    "B-4.E-4.B-3": 1111,
    "B-4.E-4.B-3.G3": 1112,
    "B-4.E-4.B-3.G4": 1113,
    "B-4.E-4.B3.F#3.B2": 1114,
    "B-4.E-4.C#5": 1115,
    "B-4.E-4.C5": 1116,
    "B-4.E-4.F#4": 1117,
    "B-4.E-4.G#4": 1118,
    "B-4.E-4.G4": 1119,
    "B-4.E-4.G4.B-3": 1120,
    "B-4.E-5": 1121,
    "B-4.E-5.B4.B3": 1122,
    "B-4.E-5.G2": 1123,
    "B-4.E-5.G4": 1124,
    "B-4.E-6": 1125,
    "B-4.E-6.B5": 1126,
    "B-4.E2": 1127,
    "B-4.E2.C4": 1128,
    "B-4.E3": 1129,
    "B-4.E3.G4": 1130,
    "B-4.E4": 1131,
    "B-4.E4.B-3": 1132,
    "B-4.E4.C#3": 1133,
    "B-4.E4.C#5": 1134,
    "B-4.E4.G3": 1135,
    "B-4.E5": 1136,
    "B-4.E5.C#5": 1137,
    "B-4.E5.C#5.G4": 1138,
    "B-4.E5.E-5": 1139,
    "B-4.E5.G4": 1140,
    "B-4.E6.C#6": 1141,
    "B-4.F#1": 1142,
    "B-4.F#2": 1143,
    "B-4.F#2.F#4": 1144,
    "B-4.F#3": 1145,
    "B-4.F#3.B-3": 1146,
    "B-4.F#3.B-3.F#4": 1147,
    "B-4.F#4": 1148,
    "B-4.F#4.A4.D3": 1149,
    "B-4.F#4.B-3": 1150,
    "B-4.F#4.C#4": 1151,
    "B-4.F#4.E-4": 1152,
    "B-4.F#5": 1153,
    "B-4.F#5.C#5.G5.C#6.B-5.G6": 1154,
    "B-4.F2": 1155,
    "B-4.F2.D4": 1156,
    "B-4.F3": 1157,
    "B-4.F3.B-3": 1158,
    "B-4.F3.C5": 1159,
    "B-4.F4": 1160,
    "B-4.F4.B-3.D4": 1161,
    "B-4.F4.C5": 1162,
    "B-4.F4.D4": 1163,
    "B-4.F4.D4.B-3": 1164,
    "B-4.F4.F3": 1165,
    "B-4.F4.G#4": 1166,
    "B-4.F5": 1167,
    "B-4.F5.C#4": 1168,
    "B-4.G#1": 1169,
    "B-4.G#1.E-2": 1170,
    "B-4.G#2": 1171,
    "B-4.G#2.D3.B-3": 1172,
    "B-4.G#2.G#3": 1173,
    "B-4.G#3": 1174,
    "B-4.G#4": 1175,
    "B-4.G#4.B-4": 1176,
    "B-4.G#4.C#3": 1177,
    "B-4.G#4.D4": 1178,
    "B-4.G#4.F#4": 1179,
    "B-4.G#4.F4": 1180,
    "B-4.G#4.F4.B-5": 1181,
    "B-4.G#5": 1182,
    "B-4.G2": 1183,
    "B-4.G2.B-3": 1184,
    "B-4.G2.C#4": 1185,
    "B-4.G2.G4": 1186,
    "B-4.G3": 1187,
    "B-4.G3.B-2": 1188,
    "B-4.G3.B-3.E-4": 1189,
    "B-4.G3.C#4": 1190,
    "B-4.G3.C#4.E-3": 1191,
    "B-4.G3.C#5": 1192,
    "B-4.G3.E-3": 1193,
    "B-4.G3.G2.D3": 1194,
    "B-4.G3.G4": 1195,
    "B-4.G4": 1196,
    "B-4.G4.B-3": 1197,
    "B-4.G4.B-3.C#4": 1198,
    "B-4.G4.B-3.E-4": 1199,
    "B-4.G4.D3.B-3.G3": 1200,
    "B-4.G4.E-4": 1201,
    "B-4.G4.E-4.B-3": 1202,
    "B-4.G4.E-4.C4.C5.E-5.G5": 1203,
    "B-4.G4.E-5": 1204,
    "B-4.G4.E3": 1205,
    "B-4.G4.G2": 1206,
    "B-4.G5": 1207,
    "B-5": 1208,
    "B-5.A3": 1209,
    "B-5.A5": 1210,
    "B-5.A5.B-2": 1211,
    "B-5.A6": 1212,
    "B-5.B-2": 1213,
    "B-5.B-3": 1214,
    "B-5.B-3.B-2.B-4": 1215,
    "B-5.B-3.B-4": 1216,
    "B-5.B-3.G#5": 1217,
    "B-5.B-4": 1218,
    "B-5.B-4.A4": 1219,
    "B-5.B-4.A5": 1220,
    "B-5.B-4.A5.A4": 1221,
    "B-5.B-4.B-2.B-1": 1222,
    "B-5.B-4.B-3": 1223,
    "B-5.B-4.B5.B4": 1224,
    "B-5.B-4.B5.G2": 1225,
    "B-5.B-4.C#4": 1226,
    "B-5.B-4.C#4.F5": 1227,
    "B-5.B-4.D5": 1228,
    "B-5.B-4.E5": 1229,
    "B-5.B-4.F#5": 1230,
    "B-5.B-4.F#5.F#4": 1231,
    "B-5.B-4.F4": 1232,
    "B-5.B-4.G#3": 1233,
    "B-5.B-4.G#5": 1234,
    "B-5.B-5": 1235,
    "B-5.B-6": 1236,
    "B-5.B-6.G6.G#6": 1237,
    "B-5.B2.B-4": 1238,
    "B-5.B4": 1239,
    "B-5.B5": 1240,
    "B-5.C#2": 1241,
    "B-5.C#3": 1242,
    "B-5.C#3.G3": 1243,
    "B-5.C#4": 1244,
    "B-5.C#4.B-4": 1245,
    "B-5.C#4.E-3.G3": 1246,
    "B-5.C#4.E3": 1247,
    "B-5.C#4.G5": 1248,
    "B-5.C#5": 1249,
    "B-5.C#5.B-3": 1250,
    "B-5.C#5.F5": 1251,
    "B-5.C#5.G#3.D3": 1252,
    "B-5.C#5.G5": 1253,
    "B-5.C#5.G5.E-3.E-2": 1254,
    "B-5.C#6": 1255,
    "B-5.C#6.E-6": 1256,
    "B-5.C#6.F6": 1257,
    "B-5.C#7.G6.E-7.E6": 1258,
    "B-5.C3": 1259,
    "B-5.C3.B-4": 1260,
    "B-5.C4": 1261,
    "B-5.C4.E3.C3.B-6": 1262,
    "B-5.C4.F4.A3.A5": 1263,
    "B-5.C5": 1264,
    "B-5.C6": 1265,
    "B-5.C6.D6": 1266,
    "B-5.D3": 1267,
    "B-5.D4": 1268,
    "B-5.D4.B-4": 1269,
    "B-5.D5": 1270,
    "B-5.D5.B-4": 1271,
    "B-5.D5.F5": 1272,
    "B-5.D5.G5": 1273,
    "B-5.D6": 1274,
    "B-5.D6.B-6": 1275,
    "B-5.D6.F5": 1276,
    "B-5.D6.G6.G4": 1277,
    "B-5.E-2.B-4": 1278,
    "B-5.E-3": 1279,
    "B-5.E-4": 1280,
    "B-5.E-4.B-4": 1281,
    "B-5.E-5": 1282,
    "B-5.E-6": 1283,
    "B-5.E2": 1284,
    "B-5.E2.C5": 1285,
    "B-5.E3.G#5": 1286,
    "B-5.E4": 1287,
    "B-5.E4.C#6": 1288,
    "B-5.E4.F5": 1289,
    "B-5.E5.C#4": 1290,
    "B-5.E5.C#5": 1291,
    "B-5.E5.G5": 1292,
    "B-5.E6": 1293,
    "B-5.F#2": 1294,
    "B-5.F#3": 1295,
    "B-5.F#4": 1296,
    "B-5.F#5": 1297,
    "B-5.F#5.B-4": 1298,
    "B-5.F#5.B-4.C#5.F#4": 1299,
    "B-5.F#5.B-4.F4": 1300,
    "B-5.F#5.C#5": 1301,
    "B-5.F#5.C4": 1302,
    "B-5.F#5.D4.A5": 1303,
    "B-5.F#5.F#4.C#4": 1304,
    "B-5.F#6": 1305,
    "B-5.F#6.C#6": 1306,
    "B-5.F2.B-4": 1307,
    "B-5.F3": 1308,
    "B-5.F3.B-4": 1309,
    "B-5.F3.F2": 1310,
    "B-5.F3.G#3.G#5": 1311,
    "B-5.F4": 1312,
    "B-5.F4.B-4": 1313,
    "B-5.F4.C4.A3.A5": 1314,
    "B-5.F4.D4": 1315,
    "B-5.F4.F5": 1316,
    "B-5.F4.G#4.B-4": 1317,
    "B-5.F5": 1318,
    "B-5.F5.B-4.D5": 1319,
    "B-5.F5.C#5": 1320,
    "B-5.F5.C#6": 1321,
    "B-5.F5.C#6.F6.C#4.F4.G3.B-3": 1322,
    "B-5.F5.F4": 1323,
    "B-5.F5.G3.C#6.B-3": 1324,
    "B-5.G#2": 1325,
    "B-5.G#2.G#5": 1326,
    "B-5.G#3": 1327,
    "B-5.G#4": 1328,
    "B-5.G#4.C5.F#4": 1329,
    "B-5.G#4.D4": 1330,
    "B-5.G#4.D4.A3.G#5": 1331,
    "B-5.G#5": 1332,
    "B-5.G1": 1333,
    "B-5.G2": 1334,
    "B-5.G3": 1335,
    "B-5.G3.E-3": 1336,
    "B-5.G3.G2": 1337,
    "B-5.G4": 1338,
    "B-5.G4.B-4": 1339,
    "B-5.G4.C4.G#3.G#5": 1340,
    "B-5.G5": 1341,
    "B-5.G5.B-4": 1342,
    "B-5.G5.E5": 1343,
    "B-5.G5.G4": 1344,
    "B-5.G6": 1345,
    "B-6": 1346,
    "B-6.A3.C6": 1347,
    "B-6.A6": 1348,
    "B-6.B-2": 1349,
    "B-6.B-5": 1350,
    "B-6.B-5.A5": 1351,
    "B-6.B-5.B-3.F#4": 1352,
    "B-6.B-5.D2": 1353,
    "B-6.B-5.D6.F6": 1354,
    "B-6.B-5.E-6.G#3": 1355,
    "B-6.B-5.F2.F3": 1356,
    "B-6.B-5.F6": 1357,
    "B-6.B-5.G6": 1358,
    "B-6.B6": 1359,
    "B-6.C#6": 1360,
    "B-6.C#6.E6": 1361,
    "B-6.C#6.F#6": 1362,
    "B-6.C#7": 1363,
    "B-6.C#7.E6": 1364,
    "B-6.C5.D4.G#4": 1365,
    "B-6.C6": 1366,
    "B-6.C7": 1367,
    "B-6.D6": 1368,
    "B-6.D6.F6": 1369,
    "B-6.D6.F6.B-5": 1370,
    "B-6.D7": 1371,
    "B-6.E-6": 1372,
    "B-6.E-6.G5.B-5": 1373,
    "B-6.E7.C#7.D7": 1374,
    "B-6.F#5.G#5.G#4": 1375,
    "B-6.F#6": 1376,
    "B-6.F#6.B-5.C#6": 1377,
    "B-6.F#6.G#6": 1378,
    "B-6.F6": 1379,
    "B-6.F7": 1380,
    "B-6.G#6": 1381,
    "B-6.G#6.D7": 1382,
    "B-6.G#6.F#6": 1383,
    "B-6.G3": 1384,
    "B-6.G3.G2.E-3": 1385,
    "B-6.G4": 1386,
    "B-6.G6": 1387,
    "B-6.G6.B-5.C#6": 1388,
    "B-6.G6.E-6.C6": 1389,
    "B-6.G6.E6": 1390,
    "B-6.G6.G4": 1391,
    "B-6.G7": 1392,
    "B0": 1393,
    "B1": 1394,
    "B1.B-1": 1395,
    "B1.B-2": 1396,
    "B1.B2": 1397,
    "B1.B2.B3.B4": 1398,
    "B1.B2.B4": 1399,
    "B1.B2.B4.B3": 1400,
    "B1.B2.B5.B6": 1401,
    "B1.B2.B6.B5": 1402,
    "B1.B2.E-4": 1403,
    "B1.B3": 1404,
    "B1.B4.B2.B3": 1405,
    "B1.C2": 1406,
    "B1.D2": 1407,
    "B1.E-3": 1408,
    "B1.E-4.B2.F#3": 1409,
    "B1.E-7": 1410,
    "B1.F#1.F#3.G#1.E4": 1411,
    "B1.F#2.D2": 1412,
    "B1.F2": 1413,
    "B2": 1414,
    "B2.A2": 1415,
    "B2.A3": 1416,
    "B2.A4": 1417,
    "B2.A4.C#3.G#4": 1418,
    "B2.A5.G#5": 1419,
    "B2.B-2": 1420,
    "B2.B-2.E2": 1421,
    "B2.B1": 1422,
    "B2.B1.B3": 1423,
    "B2.B1.B4.B3": 1424,
    "B2.B1.C#2": 1425,
    "B2.B1.D2": 1426,
    "B2.B1.E2": 1427,
    "B2.B1.E4": 1428,
    "B2.B1.G#3": 1429,
    "B2.B3": 1430,
    "B2.B3.B1": 1431,
    "B2.B3.B4": 1432,
    "B2.B3.B4.B5": 1433,
    "B2.B3.E2.D2": 1434,
    "B2.B3.F#6": 1435,
    "B2.B4": 1436,
    "B2.B4.B5.B1.F#2.D5.F#5": 1437,
    "B2.B5": 1438,
    "B2.B5.B3.B4": 1439,
    "B2.B5.B4": 1440,
    "B2.B5.B4.B1": 1441,
    "B2.C#3": 1442,
    "B2.C#4.A4.F#3": 1443,
    "B2.C#4.F#3.E2": 1444,
    "B2.C3": 1445,
    "B2.C6": 1446,
    "B2.D3": 1447,
    "B2.D4": 1448,
    "B2.D5": 1449,
    "B2.D5.G2": 1450,
    "B2.D6.D3": 1451,
    "B2.E-2": 1452,
    "B2.E-3": 1453,
    "B2.E-4": 1454,
    "B2.E-4.F#3": 1455,
    "B2.E-5": 1456,
    "B2.E-5.A4": 1457,
    "B2.E2": 1458,
    "B2.E2.B-2": 1459,
    "B2.E2.B2": 1460,
    "B2.E2.F#3": 1461,
    "B2.E3": 1462,
    "B2.E5": 1463,
    "B2.F#3": 1464,
    "B2.F#3.A2": 1465,
    "B2.F#3.C#4.E2": 1466,
    "B2.F#3.E2": 1467,
    "B2.F#4": 1468,
    "B2.F#4.E-4": 1469,
    "B2.F#5": 1470,
    "B2.F#5.A4": 1471,
    "B2.F#5.G4": 1472,
    "B2.F3": 1473,
    "B2.F4": 1474,
    "B2.F5": 1475,
    "B2.G#2": 1476,
    "B2.G#3": 1477,
    "B2.G#3.F3": 1478,
    "B2.G#4": 1479,
    "B2.G#4.C#3.A4": 1480,
    "B2.G#4.D5": 1481,
    "B2.G#4.E4": 1482,
    "B2.G1": 1483,
    "B2.G2": 1484,
    "B2.G3": 1485,
    "B2.G3.E3": 1486,
    "B2.G4": 1487,
    "B2.G5": 1488,
    "B2.G5.F5": 1489,
    "B3": 1490,
    "B3.A1": 1491,
    "B3.A3": 1492,
    "B3.A4": 1493,
    "B3.A4.C#4": 1494,
    "B3.A5": 1495,
    "B3.A5.A3": 1496,
    "B3.A5.C4": 1497,
    "B3.A5.G5": 1498,
    "B3.B-1.F3": 1499,
    "B3.B-3": 1500,
    "B3.B-4": 1501,
    "B3.B-4.B4": 1502,
    "B3.B1": 1503,
    "B3.B1.B2": 1504,
    "B3.B2": 1505,
    "B3.B2.A5.E6.E5.C#6.C#3": 1506,
    "B3.B2.B1": 1507,
    "B3.B2.B1.A4": 1508,
    "B3.B2.B1.B4": 1509,
    "B3.B2.B4": 1510,
    "B3.B2.B4.B5": 1511,
    "B3.B2.B5.B4": 1512,
    "B3.B2.E-3.E-5": 1513,
    "B3.B3": 1514,
    "B3.B4": 1515,
    "B3.B4.B2": 1516,
    "B3.B4.B2.B1": 1517,
    "B3.B4.E-5.C#5": 1518,
    "B3.B5.B4": 1519,
    "B3.B5.B4.A5": 1520,
    "B3.C#3": 1521,
    "B3.C#3.E3": 1522,
    "B3.C#3.E3.C#4": 1523,
    "B3.C#3.G#3": 1524,
    "B3.C#4": 1525,
    "B3.C#4.A6.A5": 1526,
    "B3.C#4.E-4": 1527,
    "B3.C#5": 1528,
    "B3.C2": 1529,
    "B3.C3": 1530,
    "B3.C3.G#3": 1531,
    "B3.C4": 1532,
    "B3.C4.D4": 1533,
    "B3.C5": 1534,
    "B3.D3": 1535,
    "B3.D3.B4.G#3": 1536,
    "B3.D3.D2.F3": 1537,
    "B3.D3.F3": 1538,
    "B3.D3.F3.G#4": 1539,
    "B3.D3.G3": 1540,
    "B3.D4": 1541,
    "B3.D4.G3": 1542,
    "B3.D4.G4": 1543,
    "B3.D4.G4.G5": 1544,
    "B3.D4.G5": 1545,
    "B3.D4.G6.F6": 1546,
    "B3.D5": 1547,
    "B3.D5.A3": 1548,
    "B3.D5.D4": 1549,
    "B3.D5.G3.G4": 1550,
    "B3.D6.D5": 1551,
    "B3.E-3": 1552,
    "B3.E-3.G#3": 1553,
    "B3.E-3.G#3.B4": 1554,
    "B3.E-4": 1555,
    "B3.E-4.F#4": 1556,
    "B3.E-5": 1557,
    "B3.E-5.B4": 1558,
    "B3.E-5.B4.C#5": 1559,
    "B3.E-5.E-4": 1560,
    "B3.E-5.G#4.F3": 1561,
    "B3.E2": 1562,
    "B3.E3": 1563,
    "B3.E3.C#3": 1564,
    "B3.E3.C3.C4": 1565,
    "B3.E3.G#3": 1566,
    "B3.E3.G#3.C#2.C#3": 1567,
    "B3.E3.G3": 1568,
    "B3.E4": 1569,
    "B3.E4.B4.G4": 1570,
    "B3.E4.E2": 1571,
    "B3.E4.E3": 1572,
    "B3.E4.G#3": 1573,
    "B3.E5": 1574,
    "B3.E5.G4": 1575,
    "B3.E6.G3.E3.B5": 1576,
    "B3.F#1": 1577,
    "B3.F#3": 1578,
    "B3.F#3.B2": 1579,
    "B3.F#3.D3": 1580,
    "B3.F#3.E-3": 1581,
    "B3.F#3.E-3.B2": 1582,
    "B3.F#3.G#6.A5.E-6": 1583,
    "B3.F#3.G3.D3": 1584,
    "B3.F#4": 1585,
    "B3.F#4.D4": 1586,
    "B3.F#4.E-4": 1587,
    "B3.F#4.E4": 1588,
    "B3.F#4.G#3.E-4": 1589,
    "B3.F#5": 1590,
    "B3.F3": 1591,
    "B3.F3.A2.D3": 1592,
    "B3.F3.B-3": 1593,
    "B3.F3.B4": 1594,
    "B3.F3.D3.G3": 1595,
    "B3.F3.D4": 1596,
    "B3.F3.G#3": 1597,
    "B3.F3.G4": 1598,
    "B3.F4": 1599,
    "B3.F4.A4": 1600,
    "B3.F4.B6.G#6.F6.B5": 1601,
    "B3.F4.D4": 1602,
    "B3.F4.G#3.C#6.C#5": 1603,
    "B3.F4.G3": 1604,
    "B3.F4.G4": 1605,
    "B3.F5": 1606,
    "B3.F5.F4": 1607,
    "B3.F6.F5": 1608,
    "B3.G#1": 1609,
    "B3.G#2": 1610,
    "B3.G#3": 1611,
    "B3.G#3.D3.F3": 1612,
    "B3.G#3.D4": 1613,
    "B3.G#3.E-3": 1614,
    "B3.G#3.E3": 1615,
    "B3.G#3.E4": 1616,
    "B3.G#3.F3": 1617,
    "B3.G#3.G#2.D4": 1618,
    "B3.G#4": 1619,
    "B3.G#4.D4.E3": 1620,
    "B3.G#4.E-3.E-2": 1621,
    "B3.G#4.E-4.B6.B5": 1622,
    "B3.G#4.E4": 1623,
    "B3.G#4.F5.F4": 1624,
    "B3.G#5": 1625,
    "B3.G1": 1626,
    "B3.G1.G3.G2.D3.D2": 1627,
    "B3.G2": 1628,
    "B3.G2.D3": 1629,
    "B3.G2.D3.F4": 1630,
    "B3.G3": 1631,
    "B3.G3.B2": 1632,
    "B3.G3.D3": 1633,
    "B3.G3.D4": 1634,
    "B3.G3.D4.B4": 1635,
    "B3.G3.E3": 1636,
    "B3.G3.G1.G2.D3.D2": 1637,
    "B3.G3.G2": 1638,
    "B3.G4": 1639,
    "B3.G4.A3": 1640,
    "B3.G4.D5": 1641,
    "B3.G5": 1642,
    "B3.G5.A5": 1643,
    "B3.G5.B4": 1644,
    "B4": 1645,
    "B4.A2": 1646,
    "B4.A2.C#5": 1647,
    "B4.A3.A2.C5": 1648,
    "B4.A4": 1649,
    "B4.A4.E-4": 1650,
    "B4.A4.G4": 1651,
    "B4.A5": 1652,
    "B4.A5.G5.A4": 1653,
    "B4.B-1": 1654,
    "B4.B-4": 1655,
    "B4.B1": 1656,
    "B4.B2": 1657,
    "B4.B2.A4": 1658,
    "B4.B2.C#5": 1659,
    "B4.B2.C5": 1660,
    "B4.B2.E-4.B3": 1661,
    "B4.B3": 1662,
    "B4.B3.B-3": 1663,
    "B4.B3.B2": 1664,
    "B4.B3.D4": 1665,
    "B4.B3.D5": 1666,
    "B4.B3.E-4": 1667,
    "B4.B3.G3": 1668,
    "B4.B4": 1669,
    "B4.B5": 1670,
    "B4.B5.A4": 1671,
    "B4.B5.B3.B2": 1672,
    "B4.B5.E-5.F#5": 1673,
    "B4.B6": 1674,
    "B4.C#2": 1675,
    "B4.C#3": 1676,
    "B4.C#4.B3.C#5": 1677,
    "B4.C#5": 1678,
    "B4.C#5.C5": 1679,
    "B4.C#5.E-5": 1680,
    "B4.C#5.E5": 1681,
    "B4.C2.A4.C3": 1682,
    "B4.C3": 1683,
    "B4.C3.D5": 1684,
    "B4.C3.E4": 1685,
    "B4.C4": 1686,
    "B4.C4.A4": 1687,
    "B4.C5": 1688,
    "B4.C5.C#5": 1689,
    "B4.C5.E-4.A3.F3": 1690,
    "B4.C5.F4.G#3.C4": 1691,
    "B4.C6": 1692,
    "B4.D2": 1693,
    "B4.D3": 1694,
    "B4.D3.C5": 1695,
    "B4.D3.E5": 1696,
    "B4.D3.G4": 1697,
    "B4.D4": 1698,
    "B4.D4.A4": 1699,
    "B4.D4.C5": 1700,
    "B4.D4.F#4": 1701,
    "B4.D4.F3": 1702,
    "B4.D4.F4": 1703,
    "B4.D4.G4": 1704,
    "B4.D5": 1705,
    "B4.D5.B-4": 1706,
    "B4.D5.B3": 1707,
    "B4.D5.G#3.G#2": 1708,
    "B4.D5.G4": 1709,
    "B4.D6": 1710,
    "B4.D6.G4.G5": 1711,
    "B4.D6.G5.B5": 1712,
    "B4.E-2": 1713,
    "B4.E-3": 1714,
    "B4.E-4": 1715,
    "B4.E-4.C#4": 1716,
    "B4.E-4.F#4": 1717,
    "B4.E-4.F4.G#3": 1718,
    "B4.E-4.G5": 1719,
    "B4.E-5": 1720,
    "B4.E-5.C#5": 1721,
    "B4.E-5.C#5.E5": 1722,
    "B4.E-6": 1723,
    "B4.E2": 1724,
    "B4.E3": 1725,
    "B4.E4": 1726,
    "B4.E4.C5": 1727,
    "B4.E4.D4.B3": 1728,
    "B4.E4.G#4": 1729,
    "B4.E4.G4": 1730,
    "B4.E5": 1731,
    "B4.E5.B5": 1732,
    "B4.E5.C3": 1733,
    "B4.E5.E4.G4": 1734,
    "B4.F#2": 1735,
    "B4.F#2.B1.B2.E-5.B5.G#5": 1736,
    "B4.F#3": 1737,
    "B4.F#4": 1738,
    "B4.F#4.A4": 1739,
    "B4.F#4.B3.D4.D3.F#3": 1740,
    "B4.F#4.D4": 1741,
    "B4.F#4.E-4": 1742,
    "B4.F#4.G#2": 1743,
    "B4.F#4.G2": 1744,
    "B4.F#5": 1745,
    "B4.F#5.D5.D6.B5.G6.G5": 1746,
    "B4.F#5.D5.G5.B5.D6.G6": 1747,
    "B4.F#5.E-5": 1748,
    "B4.F#6": 1749,
    "B4.F2": 1750,
    "B4.F3": 1751,
    "B4.F3.B2": 1752,
    "B4.F3.F2.C5": 1753,
    "B4.F4": 1754,
    "B4.F4.B3.G3": 1755,
    "B4.F4.C5": 1756,
    "B4.F4.C5.C4.G#3": 1757,
    "B4.F4.C5.G#3.C4": 1758,
    "B4.F4.G3": 1759,
    "B4.F4.G4": 1760,
    "B4.F5": 1761,
    "B4.G#1": 1762,
    "B4.G#2": 1763,
    "B4.G#2.B3": 1764,
    "B4.G#3": 1765,
    "B4.G#3.D4.B3": 1766,
    "B4.G#3.F3.D4": 1767,
    "B4.G#4": 1768,
    "B4.G#4.B3": 1769,
    "B4.G#4.C5": 1770,
    "B4.G#4.E4": 1771,
    "B4.G#4.F4": 1772,
    "B4.G#4.G#5.E3.E5.E2": 1773,
    "B4.G#5": 1774,
    "B4.G#5.B-4": 1775,
    "B4.G2": 1776,
    "B4.G2.F#4": 1777,
    "B4.G3": 1778,
    "B4.G3.B3.F3": 1779,
    "B4.G3.D4.F5": 1780,
    "B4.G3.D4.G4": 1781,
    "B4.G3.D5": 1782,
    "B4.G3.F#5": 1783,
    "B4.G3.F4": 1784,
    "B4.G3.G2": 1785,
    "B4.G3.G2.C5": 1786,
    "B4.G3.G5": 1787,
    "B4.G4": 1788,
    "B4.G4.A4": 1789,
    "B4.G4.C#4": 1790,
    "B4.G4.C5": 1791,
    "B4.G4.D4": 1792,
    "B4.G4.D5": 1793,
    "B4.G4.E4": 1794,
    "B4.G4.E4.B1.G1": 1795,
    "B4.G5": 1796,
    "B5": 1797,
    "B5.A2": 1798,
    "B5.A5": 1799,
    "B5.A5.C4.E4": 1800,
    "B5.A5.G#5": 1801,
    "B5.B-2": 1802,
    "B5.B-5": 1803,
    "B5.B-6": 1804,
    "B5.B3": 1805,
    "B5.B3.B4": 1806,
    "B5.B4": 1807,
    "B5.B4.A5": 1808,
    "B5.B4.B-3.F3": 1809,
    "B5.B4.B2.B3": 1810,
    "B5.B4.B3.B2": 1811,
    "B5.B4.D4": 1812,
    "B5.B4.D5": 1813,
    "B5.B4.E5": 1814,
    "B5.B4.F#5": 1815,
    "B5.B4.F2": 1816,
    "B5.B4.G5.D5": 1817,
    "B5.B6": 1818,
    "B5.C#3": 1819,
    "B5.C#4": 1820,
    "B5.C#4.B-5": 1821,
    "B5.C#4.G5": 1822,
    "B5.C#5": 1823,
    "B5.C#5.D5": 1824,
    "B5.C#5.G#2.D5": 1825,
    "B5.C#6": 1826,
    "B5.C#6.C6": 1827,
    "B5.C4.A5": 1828,
    "B5.C4.B4": 1829,
    "B5.C4.C3": 1830,
    "B5.C6": 1831,
    "B5.C6.A4.F4": 1832,
    "B5.C6.F4.C4.A3": 1833,
    "B5.D3": 1834,
    "B5.D4": 1835,
    "B5.D4.B4": 1836,
    "B5.D4.D5.B4.B3.G#3": 1837,
    "B5.D5": 1838,
    "B5.D5.B4": 1839,
    "B5.D5.B4.D4.E-3": 1840,
    "B5.D5.C5": 1841,
    "B5.D5.F5.G#5": 1842,
    "B5.D5.F5.G5": 1843,
    "B5.D5.G3": 1844,
    "B5.D5.G5.B4": 1845,
    "B5.D6": 1846,
    "B5.D6.C6": 1847,
    "B5.D6.F#6": 1848,
    "B5.E-5": 1849,
    "B5.E-5.G#5": 1850,
    "B5.E-6": 1851,
    "B5.E-6.B3": 1852,
    "B5.E-6.B6": 1853,
    "B5.E3": 1854,
    "B5.E4": 1855,
    "B5.E4.C#5": 1856,
    "B5.E4.C4.A3.E5": 1857,
    "B5.E5": 1858,
    "B5.E5.B4": 1859,
    "B5.E5.G5": 1860,
    "B5.E6": 1861,
    "B5.E6.E5": 1862,
    "B5.F#3.A5": 1863,
    "B5.F#3.A5.B5": 1864,
    "B5.F#4": 1865,
    "B5.F#4.B4": 1866,
    "B5.F#4.C#4": 1867,
    "B5.F#4.E-4.B4": 1868,
    "B5.F#5": 1869,
    "B5.F#5.B2.D5.B1.F#2.B4": 1870,
    "B5.F#5.D4": 1871,
    "B5.F#5.E-5": 1872,
    "B5.F#6": 1873,
    "B5.F3": 1874,
    "B5.F4": 1875,
    "B5.F5": 1876,
    "B5.F5.D5.G#5": 1877,
    "B5.F5.F6": 1878,
    "B5.G#2": 1879,
    "B5.G#3": 1880,
    "B5.G#3.B4": 1881,
    "B5.G#3.D4.F4.A5": 1882,
    "B5.G#5": 1883,
    "B5.G#5.D5": 1884,
    "B5.G#5.E5": 1885,
    "B5.G#5.F5.D5": 1886,
    "B5.G#6": 1887,
    "B5.G2": 1888,
    "B5.G2.F2": 1889,
    "B5.G3": 1890,
    "B5.G3.G5": 1891,
    "B5.G4": 1892,
    "B5.G5": 1893,
    "B5.G5.B4": 1894,
    "B5.G5.B4.C4.C3.E3": 1895,
    "B5.G5.C#6": 1896,
    "B5.G5.D5": 1897,
    "B5.G5.E5": 1898,
    "B5.G5.G3": 1899,
    "B5.G6": 1900,
    "B6": 1901,
    "B6.A6": 1902,
    "B6.B1": 1903,
    "B6.B3": 1904,
    "B6.B5": 1905,
    "B6.B5.D6": 1906,
    "B6.B5.F6": 1907,
    "B6.C#6.F6.B5": 1908,
    "B6.C#7": 1909,
    "B6.C#7.C7": 1910,
    "B6.C#7.E-7": 1911,
    "B6.C7": 1912,
    "B6.D7": 1913,
    "B6.E-6": 1914,
    "B6.E-6.B5": 1915,
    "B6.E-6.E-7": 1916,
    "B6.E-6.F#6": 1917,
    "B6.E-7": 1918,
    "B6.E4.C4.A3.E6": 1919,
    "B6.E6": 1920,
    "B6.E6.G#6": 1921,
    "B6.F#6": 1922,
    "B6.F#6.B5.D6": 1923,
    "B6.F6": 1924,
    "B6.F6.B5": 1925,
    "B6.F6.D6.B5": 1926,
    "B6.G#6": 1927,
    "B6.G#6.B-6.G6": 1928,
    "B6.G#6.F6": 1929,
    "B6.G6": 1930,
    "B6.G6.E-5.G4.F6": 1931,
    "C#1": 1932,
    "C#1.C#2": 1933,
    "C#1.C#3": 1934,
    "C#1.C1.B-1": 1935,
    "C#2": 1936,
    "C#2.A1": 1937,
    "C#2.A2": 1938,
    "C#2.A2.A3": 1939,
    "C#2.A2.E3.E2": 1940,
    "C#2.B-3": 1941,
    "C#2.B-5": 1942,
    "C#2.B4.E-4": 1943,
    "C#2.B5.B4": 1944,
    "C#2.C#1": 1945,
    "C#2.C#3": 1946,
    "C#2.C#3.A4": 1947,
    "C#2.C#3.B-2": 1948,
    "C#2.C#3.C#4.C#5": 1949,
    "C#2.C#3.C#5.C#4": 1950,
    "C#2.C#3.F#2": 1951,
    "C#2.C#3.G#2": 1952,
    "C#2.C#3.G4": 1953,
    "C#2.C#4": 1954,
    "C#2.C#5": 1955,
    "C#2.C#5.C#3.C#4": 1956,
    "C#2.C#5.F4": 1957,
    "C#2.C#6.F5": 1958,
    "C#2.C#7.C#3.C#6": 1959,
    "C#2.C2": 1960,
    "C#2.C5.B4": 1961,
    "C#2.D2": 1962,
    "C#2.D3.G#2": 1963,
    "C#2.E-5": 1964,
    "C#2.E-5.G#2": 1965,
    "C#2.E-6.G5": 1966,
    "C#2.E2": 1967,
    "C#2.E2.A1": 1968,
    "C#2.E4": 1969,
    "C#2.E7.C#7": 1970,
    "C#2.F#1.C#6.F#2.F#6.B-6": 1971,
    "C#2.F#2": 1972,
    "C#2.F#2.C#5.B-4.F#4.B-1.F#1": 1973,
    "C#2.F#3": 1974,
    "C#2.F#5": 1975,
    "C#2.F2": 1976,
    "C#2.F3": 1977,
    "C#2.F4": 1978,
    "C#2.F4.C#5": 1979,
    "C#2.F4.G#2": 1980,
    "C#2.F5": 1981,
    "C#2.F5.G#4": 1982,
    "C#2.G#2": 1983,
    "C#2.G#2.D3": 1984,
    "C#2.G#2.E3": 1985,
    "C#2.G#5": 1986,
    "C#2.G1": 1987,
    "C#2.G2": 1988,
    "C#3": 1989,
    "C#3.A1": 1990,
    "C#3.A1.A2": 1991,
    "C#3.A2": 1992,
    "C#3.A3": 1993,
    "C#3.A3.E3": 1994,
    "C#3.A4": 1995,
    "C#3.A4.B2": 1996,
    "C#3.A4.B2.G#4": 1997,
    "C#3.A4.E-3": 1998,
    "C#3.A4.G#4.B2": 1999,
    "C#3.B-2": 2000,
    "C#3.B-2.F2": 2001,
    "C#3.B-3": 2002,
    "C#3.B-3.C#4.G#4": 2003,
    "C#3.B-3.F4": 2004,
    "C#3.B-4": 2005,
    "C#3.B-5": 2006,
    "C#3.B2": 2007,
    "C#3.B5.E-5": 2008,
    "C#3.B6.F6": 2009,
    "C#3.C#1": 2010,
    "C#3.C#1.C#2": 2011,
    "C#3.C#2": 2012,
    "C#3.C#2.A2": 2013,
    "C#3.C#2.A4": 2014,
    "C#3.C#2.A4.A3": 2015,
    "C#3.C#2.A5.A4": 2016,
    "C#3.C#2.C#1": 2017,
    "C#3.C#2.C#4": 2018,
    "C#3.C#2.C#4.C#5": 2019,
    "C#3.C#2.C#5.C#4": 2020,
    "C#3.C#2.C3": 2021,
    "C#3.C#2.F#2": 2022,
    "C#3.C#2.F3": 2023,
    "C#3.C#2.F5": 2024,
    "C#3.C#2.G#5.G#4": 2025,
    "C#3.C#2.G3": 2026,
    "C#3.C#2.G4": 2027,
    "C#3.C#4": 2028,
    "C#3.C#4.A3": 2029,
    "C#3.C#4.C#2.A2.A3": 2030,
    "C#3.C#4.C#6.C#5": 2031,
    "C#3.C#4.E5.C#6.E6.A5": 2032,
    "C#3.C#4.F#6.F#5": 2033,
    "C#3.C#4.G#3": 2034,
    "C#3.C#5": 2035,
    "C#3.C#5.C#4": 2036,
    "C#3.C#5.F4": 2037,
    "C#3.C#6.E6": 2038,
    "C#3.C3": 2039,
    "C#3.C7.C6.C#4": 2040,
    "C#3.D3": 2041,
    "C#3.D5": 2042,
    "C#3.E-3": 2043,
    "C#3.E-3.B-4.C#4": 2044,
    "C#3.E-4": 2045,
    "C#3.E-5": 2046,
    "C#3.E1": 2047,
    "C#3.E2": 2048,
    "C#3.E3": 2049,
    "C#3.E3.A3": 2050,
    "C#3.E3.C#4": 2051,
    "C#3.E3.G#3": 2052,
    "C#3.E4": 2053,
    "C#3.E4.B-3": 2054,
    "C#3.E4.B-3.C#4": 2055,
    "C#3.E4.G3.B-4": 2056,
    "C#3.E4.G3.B3": 2057,
    "C#3.E5": 2058,
    "C#3.E5.A4": 2059,
    "C#3.E5.A4.D3": 2060,
    "C#3.F#1.F#2": 2061,
    "C#3.F#2": 2062,
    "C#3.F#2.C#4.C#5.B-4": 2063,
    "C#3.F#3": 2064,
    "C#3.F#3.C#4.A3": 2065,
    "C#3.F#4": 2066,
    "C#3.F#5": 2067,
    "C#3.F#5.F#4": 2068,
    "C#3.F2": 2069,
    "C#3.F2.F3": 2070,
    "C#3.F3": 2071,
    "C#3.F3.C#2": 2072,
    "C#3.F4": 2073,
    "C#3.F4.A3": 2074,
    "C#3.F4.A3.C#4": 2075,
    "C#3.F4.C#5": 2076,
    "C#3.F4.F5.B4.C#2": 2077,
    "C#3.F4.G#3": 2078,
    "C#3.F4.G#4.G#3": 2079,
    "C#3.F5": 2080,
    "C#3.F5.C#4": 2081,
    "C#3.F6.F5": 2082,
    "C#3.G#2.F3": 2083,
    "C#3.G#3": 2084,
    "C#3.G#3.F#5.B-4": 2085,
    "C#3.G#3.F4": 2086,
    "C#3.G#3.F4.C#5": 2087,
    "C#3.G#4": 2088,
    "C#3.G#4.G#3.F2": 2089,
    "C#3.G#5": 2090,
    "C#3.G2": 2091,
    "C#3.G3": 2092,
    "C#3.G3.B3.F4.E-2": 2093,
    "C#3.G4": 2094,
    "C#3.G5": 2095,
    "C#4": 2096,
    "C#4.A2": 2097,
    "C#4.A2.E-4": 2098,
    "C#4.A2.G3.A3": 2099,
    "C#4.A3": 2100,
    "C#4.A3.E-3": 2101,
    "C#4.A3.E3": 2102,
    "C#4.A3.G3.A2": 2103,
    "C#4.A4": 2104,
    "C#4.A4.C#6.C#5": 2105,
    "C#4.A4.F#3.B2.E2": 2106,
    "C#4.A4.F#3.E2.B2": 2107,
    "C#4.A4.F#4": 2108,
    "C#4.A5": 2109,
    "C#4.A5.C#5.F5": 2110,
    "C#4.A5.G4": 2111,
    "C#4.A6": 2112,
    "C#4.B-1.B-3.F3.B-2": 2113,
    "C#4.B-2": 2114,
    "C#4.B-3": 2115,
    "C#4.B-3.C#6": 2116,
    "C#4.B-3.E-3": 2117,
    "C#4.B-3.E-3.C#5": 2118,
    "C#4.B-3.F#4.B-5.B-6": 2119,
    "C#4.B-3.F#5.F#4": 2120,
    "C#4.B-3.F3": 2121,
    "C#4.B-3.F4": 2122,
    "C#4.B-3.G3": 2123,
    "C#4.B-4": 2124,
    "C#4.B-4.A4": 2125,
    "C#4.B-4.B-3": 2126,
    "C#4.B-4.C5": 2127,
    "C#4.B-4.F#4": 2128,
    "C#4.B-4.F4": 2129,
    "C#4.B-5.B-4": 2130,
    "C#4.B2": 2131,
    "C#4.B2.F#3.A4": 2132,
    "C#4.B3": 2133,
    "C#4.B3.F3": 2134,
    "C#4.B4": 2135,
    "C#4.B4.B3.E4.C#5": 2136,
    "C#4.B4.C#5": 2137,
    "C#4.B5": 2138,
    "C#4.B5.B4": 2139,
    "C#4.B6": 2140,
    "C#4.C#2": 2141,
    "C#4.C#2.C#3": 2142,
    "C#4.C#2.C#3.A2": 2143,
    "C#4.C#3": 2144,
    "C#4.C#3.A3": 2145,
    "C#4.C#3.B-3": 2146,
    "C#4.C#3.B-4": 2147,
    "C#4.C#3.C#2": 2148,
    "C#4.C#3.C#5.C#6": 2149,
    "C#4.C#3.C#6.C#5": 2150,
    "C#4.C#3.C3": 2151,
    "C#4.C#3.E3": 2152,
    "C#4.C#3.E4": 2153,
    "C#4.C#3.F#3": 2154,
    "C#4.C#3.G4": 2155,
    "C#4.C#5": 2156,
    "C#4.C#5.A4": 2157,
    "C#4.C#5.B-4": 2158,
    "C#4.C#5.C#2.C#3": 2159,
    "C#4.C#5.C#3.C#2": 2160,
    "C#4.C#5.C4": 2161,
    "C#4.C#5.E-4": 2162,
    "C#4.C#5.F4.G#4": 2163,
    "C#4.C#5.F5": 2164,
    "C#4.C#5.G#3": 2165,
    "C#4.C#5.G#4.B-2.B-1": 2166,
    "C#4.C#5.G#4.F4.G#3.F3": 2167,
    "C#4.C#6": 2168,
    "C#4.C#6.B3": 2169,
    "C#4.C#6.C#3.C#5": 2170,
    "C#4.C#6.C#5": 2171,
    "C#4.C3": 2172,
    "C#4.C4": 2173,
    "C#4.C4.B3": 2174,
    "C#4.C4.C4": 2175,
    "C#4.C5": 2176,
    "C#4.C6": 2177,
    "C#4.C6.E-5.C5.E-4.G#3.C4": 2178,
    "C#4.D3": 2179,
    "C#4.D3.A3": 2180,
    "C#4.D4": 2181,
    "C#4.D6": 2182,
    "C#4.E-2": 2183,
    "C#4.E-3": 2184,
    "C#4.E-3.B-3": 2185,
    "C#4.E-3.F#3.B3.F#2": 2186,
    "C#4.E-3.G3": 2187,
    "C#4.E-4": 2188,
    "C#4.E-4.B-3": 2189,
    "C#4.E-4.B-4": 2190,
    "C#4.E-4.B3": 2191,
    "C#4.E-4.C4": 2192,
    "C#4.E-4.G3": 2193,
    "C#4.E-4.G3.B-4": 2194,
    "C#4.E-5": 2195,
    "C#4.E-5.G3.E-3": 2196,
    "C#4.E2": 2197,
    "C#4.E3": 2198,
    "C#4.E3.A2": 2199,
    "C#4.E3.A3": 2200,
    "C#4.E3.B-4": 2201,
    "C#4.E3.C#2.G#2": 2202,
    "C#4.E3.G#3": 2203,
    "C#4.E3.G#3.C#5": 2204,
    "C#4.E4": 2205,
    "C#4.E4.A3": 2206,
    "C#4.E4.B-4": 2207,
    "C#4.E4.E3": 2208,
    "C#4.E4.G#3": 2209,
    "C#4.E4.G#4": 2210,
    "C#4.E4.G3": 2211,
    "C#4.E5": 2212,
    "C#4.E5.C#5": 2213,
    "C#4.E6.C#6": 2214,
    "C#4.F#1": 2215,
    "C#4.F#3": 2216,
    "C#4.F#3.A3": 2217,
